<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"6443283e433b290fa008a6e4b4edfa4f8a06c5a7cbe14f5b1b8c074395a553c0","plan_job_ref":"Job Create Terraform plan (DEV) #176 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15214787567","plan_out_hash":"6aef28af4991e2ec0b3a52fdd8e7c8aa13b25de0c4cff6f0403cfd3c89ff2925","plan_hash":"10a0bf9aa20cc1465d66753c78bfef83dff3ef3381a65f4b74eed232ec4cf2af","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.eso is tainted, so must be replaced
-/+ resource "helm_release" "eso" {
!~      id                         = "***" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "v0.17.0"
-               chart          = "external-secrets"
-               first_deployed = 1748015852
-               last_deployed  = 1748015852
-               name           = "eso"
-               namespace      = "eso"
-               notes          = <<-EOT
                    external-secrets has been deployed successfully in namespace eso!
                    
                    In order to begin using ExternalSecrets, you will need to set up a SecretStore
                    or ClusterSecretStore resource (for example, by creating a 'vault' SecretStore).
                    
                    More information on the different types of SecretStores and how to configure them
                    can be found in our Github: https://github.com/external-secrets/external-secrets
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       serviceAccount = {
-                           create = false
-                           name   = "workload-identity-sa"
                        }
                    }
                )
-               version        = "0.17.0"
            },
        ] -> (known after apply)
        name                       = "eso"
!~      status                     = "failed" -> "deployed"
!~      values                     = [
!~          <<-EOT
              + "installCRDs": true
                "serviceAccount":
              -   "create": false
              +   "annotations":
              +     "azure.workload.identity/client-id": "d2cc9fb5-5aa2-4a50-9f2a-2c0543502291"
              +   "create": true
                  "name": "workload-identity-sa"
            EOT,
        ]
#        (25 unchanged attributes hidden)
    }

  # helm_release.oauth2_proxy is tainted, so must be replaced
-/+ resource "helm_release" "oauth2_proxy" {
!~      id                         = "************" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "7.9.0"
-               chart          = "oauth2-proxy"
-               first_deployed = 1748015852
-               last_deployed  = 1748015852
-               name           = "oauth2-proxy"
-               namespace      = "authgate"
-               notes          = <<-EOT
                    CHART NAME: redis
                    CHART VERSION: 21.0.0
                    APP VERSION: 8.0.0
                    
                    Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed on the following DNS names from within your cluster:
                    
                        oauth2-proxy-redis-master.authgate.svc.cluster.local for read/write operations (port 6379)
                        oauth2-proxy-redis-replicas.authgate.svc.cluster.local for read-only operations (port 6379)
                    
                    
                    
                    To get your password run:
                    
                        export REDIS_PASSWORD=$(kubectl get secret --namespace authgate oauth2-proxy-redis -o jsonpath="{.data.redis-password}" | base64 -d)
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace authgate redis-client --restart='Never'  --env REDIS_PASSWORD=$REDIS_PASSWORD  --image docker.io/bitnami/redis:8.0.0-debian-12-r0 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace authgate -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-master
                       REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h oauth2-proxy-redis-replicas
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace authgate svc/oauth2-proxy-redis-master 6379:6379 &
                        REDISCLI_AUTH="$REDIS_PASSWORD" redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - replica.resources
                      - master.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=authgate get pods -l "app=oauth2-proxy"
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       config             = {
-                           existingSecret = "oauth2-proxy-secret"
                        }
-                       extraArgs          = [
-                           "--provider=oidc",
-                           "--oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0",
-                           "--scope=openid email profile",
-                           "--email-domain=*",
-                           "--redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback",
-                           "--skip-provider-button",
-                           "--reverse-proxy",
-                           "--cookie-secure=true",
-                           "--cookie-domain=.audioprothese.ovh",
-                           "--cookie-name=_oauth2_proxy",
-                           "--cookie-refresh=2m",
-                           "--cookie-expire=24h",
-                           "--whitelist-domain=.audioprothese.ovh",
-                           "--set-authorization-header=false",
-                           "--pass-access-token=false",
-                           "--pass-user-headers=true",
-                           "--set-xauthrequest=true",
-                           "--oidc-email-claim=preferred_username",
                        ]
-                       ingress            = {
-                           annotations = {
-                               "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                               "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                            }
-                           className   = "webapprouting.kubernetes.azure.com"
-                           enabled     = true
-                           hosts       = [
-                               "oauth2.dev.audioprothese.ovh",
                            ]
-                           path        = "/oauth2"
-                           pathType    = "Prefix"
-                           tls         = [
-                               {
-                                   hosts      = [
-                                       "oauth2.dev.audioprothese.ovh",
                                    ]
-                                   secretName = "oauth2-tls"
                                },
                            ]
                        }
-                       initContainers     = {
-                           waitForRedis = {
-                               enabled = false
                            }
                        }
-                       proxyVarsAsSecrets = true
-                       redis              = {
-                           enabled = true
                        }
-                       service            = {
-                           portNumber = 4180
-                           type       = "ClusterIP"
                        }
-                       sessionStorage     = {
-                           redis = {
-                               clientType = "standalone"
-                               standalone = {
-                                   connectionUrl = "redis://oauth2-proxy-redis-master:6379/0"
                                }
                            }
-                           type  = "redis"
                        }
                    }
                )
-               version        = "7.12.13"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
!~      status                     = "failed" -> "deployed"
#        (26 unchanged attributes hidden)
    }

  # kubectl_manifest.cluster_secretstore will be created
+   resource "kubectl_manifest" "cluster_secretstore" {
+       api_version             = "external-secrets.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ClusterSecretStore"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "azure-secret-store"
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1
            kind: ClusterSecretStore
            metadata:
              name: azure-secret-store
            spec:
              provider:
                azurekv:
                  authType: WorkloadIdentity
                  serviceAccountRef:
                    name: workload-identity-sa
                    namespace: eso
                  tenantId: b7b023b8-7c32-4c02-92a6-c8cdaa1d189c
                  vaultUrl: https://openmrs-dev-vault.vault.azure.net/
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.externalsecret will be created
+   resource "kubectl_manifest" "externalsecret" {
+       api_version             = "external-secrets.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ExternalSecret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "oauth2-proxy-secret"
+       namespace               = "authgate"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1
            kind: ExternalSecret
            metadata:
              name: oauth2-proxy-secret
              namespace: authgate
            spec:
              data:
              - remoteRef:
                  key: oauth2-proxy-client-id
                secretKey: client-id
              - remoteRef:
                  key: oauth2-proxy-client-secret
                secretKey: client-secret
              - remoteRef:
                  key: oauth2-proxy-cookie-secret
                secretKey: cookie-secret
              refreshInterval: 1h
              refreshPolicy: Periodic
              secretStoreRef:
                kind: ClusterSecretStore
                name: azure-secret-store
              target:
                creationPolicy: Owner
                name: oauth2-proxy-secret
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #176](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15214787567)